## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/20371996484)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 3 to add, 0 to change, 3 to destroy.</code></pre>

* Replace
  * github_actions_variable.kyma_modules_runtime_internal_github_token_gcp_secret_name
  * google_secret_manager_secret.kyma_modules_runtime_internal_github_token
  * google_secret_manager_secret_iam_member.kyma_modules_update_components_workflow_internal_token_reader



<details><summary>Change Result (Click me)</summary>

```hcl

  # github_actions_variable.kyma_modules_runtime_internal_github_token_gcp_secret_name must be replaced
-/+ resource "github_actions_variable" "kyma_modules_runtime_internal_github_token_gcp_secret_name" {
      ~ created_at    = "2025-12-19 12:56:25 +0000 UTC" -> (known after apply)
      ~ id            = "kyma-modules:KYMA_RUNTIME_USER_INTERNAL_GITHUB_TOKEN_GCP_SECRET_NAME" -> (known after apply)
      ~ updated_at    = "2025-12-19 12:56:25 +0000 UTC" -> (known after apply)
      ~ value         = "kyma-neighbors-runtime-serviceuser-internal-github-token" -> "kyma-prow-serviceuser-internal-github-token"
      ~ variable_name = "KYMA_RUNTIME_USER_INTERNAL_GITHUB_TOKEN_GCP_SECRET_NAME" -> "KYMA_PROW_SERVICEUSER_INTERNAL_GITHUB_TOKEN_GCP_SECRET_NAME" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # google_secret_manager_secret.kyma_modules_runtime_internal_github_token must be replaced
-/+ resource "google_secret_manager_secret" "kyma_modules_runtime_internal_github_token" {
      - annotations           = {} -> null
      ~ create_time           = "2025-12-19T12:56:24.799251Z" -> (known after apply)
      ~ effective_annotations = {} -> (known after apply)
      ~ effective_labels      = {
          ~ "entity"                     = "kyma-neighbors-runtime-serviceuser" -> "kyma-prow-serviceuser"
            # (5 unchanged elements hidden)
        }
      + expire_time           = (known after apply)
      ~ id                    = "projects/sap-kyma-prow/secrets/kyma-neighbors-runtime-serviceuser-internal-github-token" -> (known after apply)
      ~ labels                = {
          ~ "entity"          = "kyma-neighbors-runtime-serviceuser" -> "kyma-prow-serviceuser"
            # (4 unchanged elements hidden)
        }
      ~ name                  = "projects/351981214969/secrets/kyma-neighbors-runtime-serviceuser-internal-github-token" -> (known after apply)
      ~ secret_id             = "kyma-neighbors-runtime-serviceuser-internal-github-token" -> "kyma-prow-serviceuser-internal-github-token" # forces replacement
      ~ terraform_labels      = {
          ~ "entity"                     = "kyma-neighbors-runtime-serviceuser" -> "kyma-prow-serviceuser"
            # (5 unchanged elements hidden)
        }
      - version_aliases       = {} -> null
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # google_secret_manager_secret_iam_member.kyma_modules_update_components_workflow_internal_token_reader must be replaced
-/+ resource "google_secret_manager_secret_iam_member" "kyma_modules_update_components_workflow_internal_token_reader" {
      ~ etag      = "BwZGTZrmbmQ=" -> (known after apply)
      ~ id        = "projects/sap-kyma-prow/secrets/kyma-neighbors-runtime-serviceuser-internal-github-token/roles/secretmanager.secretAccessor/principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/attribute.repository.id/172960/attribute.reusable_workflow_ref/kyma/test-infra/.github/workflows/reusable-update-components.yml@refs/heads/main" -> (known after apply)
      ~ secret_id = "projects/sap-kyma-prow/secrets/kyma-neighbors-runtime-serviceuser-internal-github-token" -> "kyma-prow-serviceuser-internal-github-token" # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev"
        name                   = "dev"
      ~ update_time            = "2025-12-19T12:50:00.190210Z" -> "2025-12-19T13:50:51.899876Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.docker_cache.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/cache"
        name                   = "cache"
      ~ update_time            = "2025-12-19T12:50:58.445393Z" -> "2025-12-19T13:48:12.317198Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dockerhub-mirror"
        name                   = "dockerhub-mirror"
      ~ update_time            = "2025-12-19T12:44:51.346249Z" -> "2025-12-19T13:45:36.730940Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/prod"
        name                   = "prod"
      ~ update_time            = "2025-12-19T12:56:03.491484Z" -> "2025-12-19T13:45:03.790972Z"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":13675,"Program":"tfcmt","SHA1":"c515f0b12879efcddd1914cd3ff217f690532bfb","Vars":{},"WorkflowName":"workflow-controller-pull-requests"} -->